#include <stdio.h>
#include <string.h>
#include "MenuIO.h"

/* OUT */

/* 
================== [ 다이어트 관리 프로그램 ] ==================
-----------------------------------------------------------
[ 선택 --------------------------------------------------- ]
1. 회원가입
2. 로그인
3. 프로그램 종료
D : Input Error
-----------------------------------------------------------
메뉴 선택 : 
-----------------------------------------------------------
===========================================================
*/

int mainMenu() {
    int meunNumber = 0;

    P_MENU_TITLE("다이어트 관리 프로그램");
    P_MENU_IN;
    P_MENU_SB_S("선택", "----");
    
    printf("1. 회원가입\n");
    printf("2. 로그인\n");
    printf("3. 프로그램 종료\n");

    P_MENU_IN;

    meunNumber = inputMenu("메뉴 선택 : ", "%d");
    
    P_MENU_IN;
    
    P_MENU_END;

    return meunNumber;
}

/* 
================== [      회원 가입      ] ==================
-----------------------------------------------------------
ID : _
비밀번호 : _
성별 : _
나이 : _ 
초기 체중 : _
목표 체중 : _
-----------------------------------------------------------
회원가입을 하시겠습니까?[Y/N] : _
-----------------------------------------------------------
Y : 회원가입가 완료 되었습니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void signupMenu(char *id, char *pw) {
    //  int *age, char *gender, float *height, float *initialWeight, float *goalWeight
    P_MENU_TITLE("회원가입");
    P_MENU_IN;
    P_MENU_SB_S("입력", "----");
    
    inputLine("ID 입력: ", id, 50);
    inputLine("PW 입력 ", pw, 50);

    /* 
    printf("나이: ");
    scanf("%d", age);
    getchar();
    printf("성별 ");
    fgets(gender, sizeof(gender), stdin);
    gender[strcspn(gender, "\n")] = 0;

    printf("키 : ");
    scanf("%f", height);

    printf("초기 체중 : ");
    scanf("%f", initialWeight);
    
    printf("목표 체중 : ");
    scanf("%f", goalWeight); 
    */

    P_MENU_IN;
    P_MENU_END;
}

/* 
================== [       로그인       ] ==================
-----------------------------------------------------------
ID : _
비밀번호 : _
-----------------------------------------------------------
로그인 하시겠습니까?[Y/N] : _
-----------------------------------------------------------
Y : 로그인이 완료 되었습니다. / 로그인이 실패 되었습니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void loginMenu(char *id, char *pw) {
    P_MENU_TITLE("회원가입");
    P_MENU_IN;
    P_MENU_SB_S("입력", "----");
    
    inputLine("ID 입력: ", id, 50);
    inputLine("PW 입력 ", pw, 50);

    P_MENU_IN;
    P_MENU_END;
}

/* 
================== [     사용자 메뉴     ] ==================
(사용자 ID) 님 안녕하세요
-----------------------------------------------------------
[ 선택 --------------------------------------------------- ]
1. 식단 입력
2. 운동 입력
3. 체중 입력
4. 날짜별 기록 조회
5. 감량 진행률 조회
6. 피드백 보기
7. 로그아웃
8. 회원탈퇴
D : Input Error
-----------------------------------------------------------
메뉴 선택 : 
-----------------------------------------------------------
===========================================================
*/

int userMenu(char *id) {
    int meunNumber = 0;

    P_MENU_TITLE("사용자 메뉴");
    printf("%s 님 안녕하세요\n", id);
    P_MENU_IN;
    P_MENU_SB_S("선택", "---");
    
    printf("1. 식단 입력\n");
    printf("2. 운동 입력\n");
    printf("3. 체중 입력\n");
    printf("4. 날짜별 기록 조회\n");
    printf("5. 감량 진행률 조회\n");
    printf("6. 피드백 보기\n");
    printf("7. 로그아웃\n");
    printf("8. 회원탈퇴\n");
    // printf("D : Input Error\n");
    
    P_MENU_IN;
    
    meunNumber = inputMenu("메뉴 선택 : ", "%d");
    
    P_MENU_IN;
    P_MENU_END;

    return meunNumber;
}

/* 
================== [      식단 입력      ] ==================
-----------------------------------------------------------
날짜/시간(YYYY-MM-DD HH:MM) : _
음식명 : _
섭취량(g) : _
-----------------------------------------------------------
식단을 저장 하시겠습니까?[Y/N] : _
-----------------------------------------------------------
Y : 식단이 저장 되었습니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void mealMenu(char *mealDateTime, char *foodName, float *gram) {
    P_MENU_TITLE("식단 입력");
    P_MENU_IN;

    inputLine("날짜/시간(YYYY-MM-DD HH:MM) : ", mealDateTime, 16);
    inputLine("음식명 : ", foodName, 50);
    getchar();
    
    printf("섭취량(g) : ");
    scanf("%f", gram);

    P_MENU_IN;
    P_MENU_END;
}

/* 
================== [      운동 입력      ] ==================
-----------------------------------------------------------
날짜/시간(YYYY-MM-DD HH:MM) : _
운동명 : _
시간(H) : _
-----------------------------------------------------------
운동을 저장 하시겠습니까?[Y/N] : _
-----------------------------------------------------------
Y : 운동이 저장 되었습니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void workOutMenu(char *workOutDateTime, char *workOutname, float *Time) {
    P_MENU_TITLE("운동 입력");
    P_MENU_IN;

    inputLine("날짜/시간(YYYY-MM-DD HH:MM) : ", workOutDateTime, 16);
    inputLine("운동명 : ", workOutname, 50);
    printf("시간(H) : ");
    scanf("%f", Time);

    P_MENU_IN;
    P_MENU_END;
}

/* 
================== [      체중 입력      ] ==================
-----------------------------------------------------------
날짜/시간(YYYY-MM-DD HH:MM) : _
체중 : _
-----------------------------------------------------------
체중을 저장 하시겠습니까?[Y/N] : _
-----------------------------------------------------------
Y : 체중이 저장 되었습니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void weightMenu(char *weightDateTime, float *weight) {
    P_MENU_TITLE("체중 입력");
    P_MENU_IN;

    inputLine("날짜/시간(YYYY-MM-DD HH:MM) : ", weightDateTime, 16);
    printf("체중 : ");
    scanf("%f", weight);

    P_MENU_IN;
    P_MENU_END;
}

/* 
================== [   날짜별 기록 조회    ] ==================
-----------------------------------------------------------
[ 기록 ---------------------------------------------------- ]
1. 2025-05-20
2. 2025-05-21
3. 2025-05-23
n. ...
-1 : 기록이 존재 하지 않습니다.
-----------------------------------------------------------
[ 선택 ---------------------------------------------------- ]
확인할 날짜 선택 : _
D : 입력한 날짜는 존재하지 않습니다.
-----------------------------------------------------------
해당 (선택한 날짜)의 기록
식단 | 운동 | 체중
-----------------------------------------------------------
뒤로 가기[Y/N] : 
-----------------------------------------------------------
Y : 뒤로 갑니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void viewRecordsByDateMenu() {
    P_MENU_TITLE("날짜별 기록 조회");
    P_MENU_IN;
    P_MENU_SB_S("기록", "---");

    printf("날짜 전체 출력..");

    P_MENU_IN;
    P_MENU_SB_S("선택", "---");
    inputMenu("확인할 날짜 선택 :", "%d");
    
    P_MENU_IN;
    printf("DateTiem의 기록\n");
    printf("식단 : %s | 운동 : %s | 체중 : %f", "1", "2", 38.0);
    
    P_MENU_IN;
    P_MENU_END;
}

/* 
================== [   감량 진행률 조회    ] ==================
-----------------------------------------------------------
초기 / 목표 / 현재 체중 + 달성률(%) 출력
-----------------------------------------------------------
뒤로 가기[Y/N] : 
-----------------------------------------------------------
Y : 뒤로 갑니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void checkWeightLossProgressMenu(const float initialWeight, const float goalWeight, const float currentWeight) {
    float achievementRate = 0;
    P_MENU_TITLE("감량 진행률 조회");
    P_MENU_IN;

    // 초기 / 목표 / 현재 체중 + 달성률(%) 출력
    printf("초기 체중 : %f", initialWeight);
    printf("목표 체중 : %f", goalWeight);
    printf("현재 체중 : %f", currentWeight);
    printf("달성률 : %f", achievementRate);

    P_MENU_IN;
    P_MENU_END;
}

/* 
================== [       피드백       ] ==================
-----------------------------------------------------------
체중 증가 또는 칼로리 초과시 추천 출력
-----------------------------------------------------------
뒤로 가기[Y/N] : 
-----------------------------------------------------------
Y : 뒤로 갑니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void feedBackMenu(const float weight, const float kcal) {
    P_MENU_TITLE("피드백");
    P_MENU_IN;
    
    printf("체중 증가 또는 칼로리 초과시 추천 출력\n");
    printf("%f | %f\n", weight, kcal);
    printf("음식 API\n");

    P_MENU_IN;
    P_MENU_END;
}

/* 
=================== [     로그 아웃     ] ===================
-----------------------------------------------------------
(사용자 ID)를 로그아웃 하시겠습니까?[Y/N]
-----------------------------------------------------------
Y : 로그아웃 되었습니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void logOutMenu(const char *id) {
    P_MENU_TITLE("로그 아웃");
    P_MENU_IN;

    printf("%s 이/가 로그아웃 되었습니다.", id);

    P_MENU_IN;
    P_MENU_END;
}

/* 
=================== [     회원 탈퇴     ] ===================
-----------------------------------------------------------
(사용자 ID)를 회원탈퇴를 하시겠습니까?[Y/N]
-----------------------------------------------------------
Y : 회원탈퇴 처리 되었습니다.
N : 취소.
D : Input Error
-----------------------------------------------------------
===========================================================
*/

void deleteIdMenu(const char *id) {
    P_MENU_TITLE("회원 탈퇴");
    P_MENU_IN;

    printf("%s 이/가 회원 탈퇴 처리 되었습니다.\n", id);
    printf("DB에서 해당 id 삭제\n");
    P_MENU_IN;
    P_MENU_END;
}

/* In */

void inputLine(const char *prompt, char *buf, int size) {
    printf("%s", prompt);
    fgets(buf, size, stdin);
    buf[strcspn(buf, "\n")] = '\0';  // 개행 제거
}

int inputMenu(const char *prompt, const char *type) {
    int meunNumber;

    printf("%s", prompt);
    scanf(type, &meunNumber);
    getchar(); // 남은 개행 제거

    return meunNumber;
}